In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
df =pd.read_excel('C:/Users/mjc341/Desktop/TESTPY/PY_ACT_EXTRACT.xlsx')

In [4]:
df.head()

       Empl  WR WRS WRS16  Test Date Date Loaded
0  54211370       8   NaN 2016-04-01  2016-09-08
1  54211370       8   NaN 2016-06-01  2016-09-08
2  54215024      10   NaN 2016-04-01  2016-09-08
3  54215024            -- 2016-06-01  2016-09-08
4  54210965       8   NaN 2016-04-01  2016-09-08

In [22]:
ACT_MELT= pd.melt(df, id_vars = 'Empl', value_vars= ['WR'])

In [21]:
ACT_MELT.head()

       Empl variable value
0  54211370       WR
1  54211370       WR
2  54215024       WR
3  54215024       WR
4  54210965       WR

In [23]:
ACT_MELT2= pd.melt(df, id_vars = 'Empl', value_vars= ['WRS'])

In [24]:
ACT_MELT2.head()

       Empl variable value
0  54211370      WRS     8
1  54211370      WRS     8
2  54215024      WRS    10
3  54215024      WRS
4  54210965      WRS     8

In [26]:
ACT_MELT3= pd.melt(df, id_vars = 'Empl', value_vars= ['WRS16'])

In [27]:
ACT_MELT3.head()

       Empl variable value
0  54211370    WRS16   NaN
1  54211370    WRS16   NaN
2  54215024    WRS16   NaN
3  54215024    WRS16    --
4  54210965    WRS16   NaN

In [29]:
ACT_MELT4 = pd.melt(df, id_vars = 'Empl', value_vars= ['Test Date','WR'])

In [32]:
ACT_MELT4.head()

       Empl   variable                value
0  54211370  Test Date  2016-04-01 00:00:00
1  54211370  Test Date  2016-06-01 00:00:00
2  54215024  Test Date  2016-04-01 00:00:00
3  54215024  Test Date  2016-06-01 00:00:00
4  54210965  Test Date  2016-04-01 00:00:00

In [35]:
MLT= pd.melt(df, id_vars = 'Empl', value_vars= ['Test Date','WR'])

In [37]:
MLT.info

<bound method DataFrame.info of            Empl   variable                value
0      54211370  Test Date  2016-04-01 00:00:00
1      54211370  Test Date  2016-06-01 00:00:00
2      54215024  Test Date  2016-04-01 00:00:00
3      54215024  Test Date  2016-06-01 00:00:00
4      54210965  Test Date  2016-04-01 00:00:00
5      54212324  Test Date                  NaT
6      54213145  Test Date  2016-06-01 00:00:00
7      54217072  Test Date  2016-04-01 00:00:00
8      54217072  Test Date  2016-04-01 00:00:00
9      54238182  Test Date  2016-04-01 00:00:00
10     54214098  Test Date  2016-04-01 00:00:00
11     54211184  Test Date  2015-09-01 00:00:00
12     54213382  Test Date  2016-04-01 00:00:00
13     54212640  Test Date  2016-02-01 00:00:00
14     54212640  Test Date  2016-04-01 00:00:00
15     54212640  Test Date  2016-06-01 00:00:00
16     54216114  Test Date  2015-10-01 00:00:00
17     54216114  Test Date                  NaT
18     54211332  Test Date  2016-04-01 00:00:00
19     54211389  Test Date  2016-06-01 00:00:00
20     54211408  Test Date  2016-06-01 00:00:00
21     54216852  Test Date  2016-06-01 00:00:00
22     54214732  Test Date  2016-02-01 00:00:00
23     54220663  Test Date                  NaT
24     54213927  Test Date  2016-04-01 00:00:00
25     54215882  Test Date  2015-10-01 00:00:00
26     54215882  Test Date  2015-06-01 00:00:00
27     54212175  Test Date  2015-06-01 00:00:00
28     54211157  Test Date  2016-06-01 00:00:00
29     54222197  Test Date  2016-04-01 00:00:00
...         ...        ...                  ...
46130  54281688         WR
46131  54295582         WR
46132  54295582         WR
46133  54272706         WR
46134  54272883         WR
46135  54272883         WR
46136  54276477         WR
46137  54279008         WR
46138  54171195         WR
46139  54264997         WR
46140  54276013         WR
46141  54277922         WR
46142  54276476         WR
46143  54259431         WR
46144  54279693         WR
46145  54276231         WR
46146  54284383         WR
46147  54280559         WR
46148  54216975         WR
46149  54216975         WR
46150  54276517         WR
46151  54272820         WR
46152  54272680         WR
46153  54272680         WR
46154  54272783         WR
46155  54249377         WR
46156  54275249         WR
46157  54276559         WR
46158  54278812         WR
46159  54275750         WR

[46160 rows x 3 columns]>

In [38]:
MLT.head()

       Empl   variable                value
0  54211370  Test Date  2016-04-01 00:00:00
1  54211370  Test Date  2016-06-01 00:00:00
2  54215024  Test Date  2016-04-01 00:00:00
3  54215024  Test Date  2016-06-01 00:00:00
4  54210965  Test Date  2016-04-01 00:00:00